---
kind: property
id: P:Autodesk.Revit.DB.RevolvedSurface.XDir
source: html/ba8f06da-2b43-a964-292e-79b37a7dd97e.htm
---
# Autodesk.Revit.DB.RevolvedSurface.XDir Property

X axis of the local coordinate system associated with this revolved surface.

## Syntax (C#)
```csharp
public XYZ XDir { get; }
```